luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMtu_bf.h
/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2DTAIU */
#define IFX_MTU_MEMSTAT0_CPU2DTAIU_OFF (2u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2PSAIU */
#define IFX_MTU_MEMSTAT0_CPU2PSAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2PSAIU */
#define IFX_MTU_MEMSTAT0_CPU2PSAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2PSAIU */
#define IFX_MTU_MEMSTAT0_CPU2PSAIU_OFF (3u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2PTAIU */
#define IFX_MTU_MEMSTAT0_CPU2PTAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2PTAIU */
#define IFX_MTU_MEMSTAT0_CPU2PTAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2PTAIU */
#define IFX_MTU_MEMSTAT0_CPU2PTAIU_OFF (5u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_OFF (26u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMCAIU */
#define IFX_MTU_MEMSTAT0_HSMCAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMCAIU */
#define IFX_MTU_MEMSTAT0_HSMCAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMCAIU */
#define IFX_MTU_MEMSTAT0_HSMCAIU_OFF (23u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMRAIU */
#define IFX_MTU_MEMSTAT0_HSMRAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMRAIU */
#define IFX_MTU_MEMSTAT0_HSMRAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMRAIU */
#define IFX_MTU_MEMSTAT0_HSMRAIU_OFF (25u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMTAIU */
#define IFX_MTU_MEMSTAT0_HSMTAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMTAIU */
#define IFX_MTU_MEMSTAT0_HSMTAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMTAIU */
#define IFX_MTU_MEMSTAT0_HSMTAIU_OFF (24u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_OFF (27u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_OFF (14u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_OFF (19u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_OFF (16u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_OFF (17u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_OFF (6u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_OFF (8u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_OFF (9u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_OFF (11u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2DSEN */
#define IFX_MTU_MEMTEST0_CPU2DSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2DSEN */
#define IFX_MTU_MEMTEST0_CPU2DSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2DSEN */
#define IFX_MTU_MEMTEST0_CPU2DSEN_OFF (0u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2DTEN */
#define IFX_MTU_MEMTEST0_CPU2DTEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2DTEN */
#define IFX_MTU_MEMTEST0_CPU2DTEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2DTEN */
#define IFX_MTU_MEMTEST0_CPU2DTEN_OFF (2u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2PSEN */
#define IFX_MTU_MEMTEST0_CPU2PSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2PSEN */
#define IFX_MTU_MEMTEST0_CPU2PSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2PSEN */
#define IFX_MTU_MEMTEST0_CPU2PSEN_OFF (3u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2PTEN */
#define IFX_MTU_MEMTEST0_CPU2PTEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2PTEN */
#define IFX_MTU_MEMTEST0_CPU2PTEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2PTEN */
#define IFX_MTU_MEMTEST0_CPU2PTEN_OFF (5u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPUXDS2EN */
#define IFX_MTU_MEMTEST0_CPUXDS2EN_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPUXDS2EN */
#define IFX_MTU_MEMTEST0_CPUXDS2EN_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPUXDS2EN */
#define IFX_MTU_MEMTEST0_CPUXDS2EN_OFF (20u)

