luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMtu_bf.h
/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_OFF (22u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_OFF (26u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_OFF (31u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_OFF (28u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_OFF (29u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_OFF (30u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_OFF (12u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_OFF (13u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_OFF (7u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_OFF (14u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML10EN */
#define IFX_MTU_MEMTEST1_EMEML10EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML10EN */
#define IFX_MTU_MEMTEST1_EMEML10EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML10EN */
#define IFX_MTU_MEMTEST1_EMEML10EN_OFF (24u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML11EN */
#define IFX_MTU_MEMTEST1_EMEML11EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML11EN */
#define IFX_MTU_MEMTEST1_EMEML11EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML11EN */
#define IFX_MTU_MEMTEST1_EMEML11EN_OFF (25u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML12EN */
#define IFX_MTU_MEMTEST1_EMEML12EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML12EN */
#define IFX_MTU_MEMTEST1_EMEML12EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML12EN */
#define IFX_MTU_MEMTEST1_EMEML12EN_OFF (26u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML13EN */
#define IFX_MTU_MEMTEST1_EMEML13EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML13EN */
#define IFX_MTU_MEMTEST1_EMEML13EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML13EN */
#define IFX_MTU_MEMTEST1_EMEML13EN_OFF (27u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML14EN */
#define IFX_MTU_MEMTEST1_EMEML14EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML14EN */
#define IFX_MTU_MEMTEST1_EMEML14EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML14EN */
#define IFX_MTU_MEMTEST1_EMEML14EN_OFF (28u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML15EN */
#define IFX_MTU_MEMTEST1_EMEML15EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML15EN */
#define IFX_MTU_MEMTEST1_EMEML15EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML15EN */
#define IFX_MTU_MEMTEST1_EMEML15EN_OFF (29u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_OFF (15u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_OFF (16u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_OFF (17u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_OFF (18u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML5EN */
#define IFX_MTU_MEMTEST1_EMEML5EN_LEN (1u)

