luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMtu_bf.h
/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML5EN */
#define IFX_MTU_MEMTEST1_EMEML5EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML5EN */
#define IFX_MTU_MEMTEST1_EMEML5EN_OFF (19u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML6EN */
#define IFX_MTU_MEMTEST1_EMEML6EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML6EN */
#define IFX_MTU_MEMTEST1_EMEML6EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML6EN */
#define IFX_MTU_MEMTEST1_EMEML6EN_OFF (20u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML7EN */
#define IFX_MTU_MEMTEST1_EMEML7EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML7EN */
#define IFX_MTU_MEMTEST1_EMEML7EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML7EN */
#define IFX_MTU_MEMTEST1_EMEML7EN_OFF (21u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML8EN */
#define IFX_MTU_MEMTEST1_EMEML8EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML8EN */
#define IFX_MTU_MEMTEST1_EMEML8EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML8EN */
#define IFX_MTU_MEMTEST1_EMEML8EN_OFF (22u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML9EN */
#define IFX_MTU_MEMTEST1_EMEML9EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML9EN */
#define IFX_MTU_MEMTEST1_EMEML9EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML9EN */
#define IFX_MTU_MEMTEST1_EMEML9EN_OFF (23u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEMUXEN */
#define IFX_MTU_MEMTEST1_EMEMUXEN_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEMUXEN */
#define IFX_MTU_MEMTEST1_EMEMUXEN_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEMUXEN */
#define IFX_MTU_MEMTEST1_EMEMUXEN_OFF (30u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_OFF (8u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0OEN */
#define IFX_MTU_MEMTEST1_ERAY0OEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0OEN */
#define IFX_MTU_MEMTEST1_ERAY0OEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY0OEN */
#define IFX_MTU_MEMTEST1_ERAY0OEN_OFF (6u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0TEN */
#define IFX_MTU_MEMTEST1_ERAY0TEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0TEN */
#define IFX_MTU_MEMTEST1_ERAY0TEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY0TEN */
#define IFX_MTU_MEMTEST1_ERAY0TEN_OFF (7u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY1XEN */
#define IFX_MTU_MEMTEST1_ERAY1XEN_LEN (3u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY1XEN */
#define IFX_MTU_MEMTEST1_ERAY1XEN_MSK (0x7u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY1XEN */
#define IFX_MTU_MEMTEST1_ERAY1XEN_OFF (9u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.GTM1BEN */
#define IFX_MTU_MEMTEST1_GTM1BEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.GTM1BEN */
#define IFX_MTU_MEMTEST1_GTM1BEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.GTM1BEN */
#define IFX_MTU_MEMTEST1_GTM1BEN_OFF (0u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.GTM2EN */
#define IFX_MTU_MEMTEST1_GTM2EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.GTM2EN */
#define IFX_MTU_MEMTEST1_GTM2EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.GTM2EN */
#define IFX_MTU_MEMTEST1_GTM2EN_OFF (1u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.MCAN0EN */
#define IFX_MTU_MEMTEST1_MCAN0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.MCAN0EN */
#define IFX_MTU_MEMTEST1_MCAN0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.MCAN0EN */
#define IFX_MTU_MEMTEST1_MCAN0EN_OFF (4u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.MCAN1EN */
#define IFX_MTU_MEMTEST1_MCAN1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.MCAN1EN */
#define IFX_MTU_MEMTEST1_MCAN1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.MCAN1EN */
#define IFX_MTU_MEMTEST1_MCAN1EN_OFF (5u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.MCDSEN */
#define IFX_MTU_MEMTEST1_MCDSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.MCDSEN */
#define IFX_MTU_MEMTEST1_MCDSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.MCDSEN */
#define IFX_MTU_MEMTEST1_MCDSEN_OFF (13u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.PSI5EN */
#define IFX_MTU_MEMTEST1_PSI5EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.PSI5EN */
#define IFX_MTU_MEMTEST1_PSI5EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.PSI5EN */
#define IFX_MTU_MEMTEST1_PSI5EN_OFF (2u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_OFF (12u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_OFF (14u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF1EN */
#define IFX_MTU_MEMTEST2_CIF1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF1EN */
#define IFX_MTU_MEMTEST2_CIF1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF1EN */
#define IFX_MTU_MEMTEST2_CIF1EN_OFF (16u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF2EN */
#define IFX_MTU_MEMTEST2_CIF2EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF2EN */
#define IFX_MTU_MEMTEST2_CIF2EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF2EN */
#define IFX_MTU_MEMTEST2_CIF2EN_OFF (17u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_OFF (15u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_LEN (1u)

