luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMtu_bf.h
/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_OFF (19u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMUxEN */
#define IFX_MTU_MEMTEST2_EMEMUXEN_LEN (14u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMUxEN */
#define IFX_MTU_MEMTEST2_EMEMUXEN_MSK (0x3fffu)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMUxEN */
#define IFX_MTU_MEMTEST2_EMEMUXEN_OFF (0u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.FFTxEN */
#define IFX_MTU_MEMTEST2_FFTXEN_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.FFTxEN */
#define IFX_MTU_MEMTEST2_FFTXEN_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.FFTxEN */
#define IFX_MTU_MEMTEST2_FFTXEN_OFF (22u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.STBY2EN */
#define IFX_MTU_MEMTEST2_STBY2EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.STBY2EN */
#define IFX_MTU_MEMTEST2_STBY2EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.STBY2EN */
#define IFX_MTU_MEMTEST2_STBY2EN_OFF (18u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.XTMxEN */
#define IFX_MTU_MEMTEST2_XTMXEN_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.XTMxEN */
#define IFX_MTU_MEMTEST2_XTMXEN_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.XTMxEN */
#define IFX_MTU_MEMTEST2_XTMXEN_OFF (20u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMTU_BF_H */
